# ==============================================================================
# Docker
# ==============================================================================
up: ## Dockerコンテナを起動し、Vite開発サーバーを起動します
	docker-compose up -d
	npm run dev

down: ## Dockerコンテナを停止します
	docker-compose down

# ==============================================================================
# その他
# ==============================================================================
.PHONY: help
help: ## このヘルプメッセージを表示します
	@grep -E '^[a-zA-Z_-]+:.*?## .*$$' $(MAKEFILE_LIST) | sort | awk 'BEGIN {FS = ":.*?## "}; {printf "\033[36m%-20s\033[0m %s\n", $$1, $$2}'

.DEFAULT_GOAL := help 